<template>
  <article class="page-content">
    <h1>Planning Poker — онлайн покер планирования задач</h1>
    <p>
      Метод планирования с помощью покерных карт берет свое начало от метода оценки трудозатрат в
      Scrum (подробнее см. в разделе « Оценка трудозатрат в Scrum »), называемого широкополосным
      методом Дельфи, разработанного корпорацией RAND в 1940-х годах. Оригинальный метод Дельфи
      предполагал предоставление независимым экспертам анкет и получение обратной связи посредством
      итеративных раундов до достижения консенсусной оценки.
    </p>
    <p>
      Метод «планирования покера», разработанный Майком Коном, включает в себя некоторые из этих
      идей, но больше фокусируется на коллективном принятии решений всеми участниками, а не только
      на мнении экспертов. Более того, Джеймс Греннинг внес свой вклад в разработку «планирования
      покера» в рамках сообщества Agile. Он вместе с Майком Коном, Алистером Кокберном и другими,
      известен своим участием в создании и популяризации «планирования покера» как метода оценки в
      Agile. Джеймс Греннинг был активной фигурой в сообществах Agile и разработки программного
      обеспечения, и его вклад, наряду с вкладом других, сыграл роль в формировании практик Agile,
      включая использование таких методов, как «планирование покера», для эффективного командного
      взаимодействия и оценки в Scrum и других методологиях Agile.
    </p>
    <img :src="scrumPlanningPokerImage" alt="Игра в Planning Poker" />
    <p>
      Основные принципы Scrum Planning Poker — это сотрудничество, точность, ответственность и
      прозрачность. Учет мнений всех членов команды при оценке задач или историй способствует
      лучшему пониманию зависимостей и потенциальных рисков, связанных с задачей. Таким образом,
      можно эффективно прояснить любые вопросы, касающиеся сложности функций в бэклоге продукта и
      адекватно оценить проект. Кроме того, Scrum Planning Poker помогает укрепить доверие между
      членами команды. Он включает различные роли, такие как скрам-мастер и сотрудников, работающих
      с клиентами. Итоги голосования раскрываются одновременно, это позволяет избежать предвзятости.
      Обсуждение, необходимое для достижения консенсуса, добавляет прозрачности процессу оценки, что
      высоко ценится многими организациями.
    </p>
    <p>
      Это похоже на групповой проект, где каждый участник, от представителей заказчика до
      скрам-мастера, обладает уникальным набором навыков, мнений и опыта. Группа использует
      разнообразные точки зрения для анализа пользовательских историй, что способствует принятию
      более взвешенных решений.
    </p>
    <p>
      Теперь вы понимаете основы планирования в Scrum с помощью покера. Но для более подробного
      изучения всех его аспектов, предлагаем ознакомиться с самыми популярными вопросами.
    </p>
    <section>
      <h2>Оценка трудозатрат</h2>
      <p>
        В Scrum Planning Poker каждый член команды оценивает сложность или трудозатраты блоков в
        относительном выражении, присваивая им баллы от 1 до 100 с помощью специальных карточек.
      </p>
      <p>
        Как же подготовить колоду карт? Или, другими словами, как скрам-мастер координирует эту
        карточную систему в Jira?
      </p>
      <p>
        Для эффективного внедрения Scrum Planning Poker первым шагом для скрам-мастера является
        подготовка стандартной колоды карт. Эта колода должна содержать числа, представляющие
        различные значения от 0 до 100 и предназначенные для определенных целей.
      </p>
    </section>
    <section>
      <h2>
        Составление колоды карт и определение согласованного количества очков (сюжетных баллов)
      </h2>
      <p>
        Каждое значение отражает уровень усилий или сложности, связанный с отдельным пунктом
        истории. Чем выше число, тем сложнее или ценнее единица работы. Однако важно отметить, что
        значение карточек может варьироваться в зависимости от сложности проекта и навыков,
        имеющихся в команде.
      </p>
      <div class="table-scroll">
        <table class="estimation-table">
          <thead>
            <tr>
              <th>Цель</th>
              <th>1-10</th>
              <th>Fibonacci</th>
              <th class="wrap">Fibonacci modified</th>
              <th>Степень 2</th>
            </tr>
          </thead>
          <tbody>
            <tr v-for="(value, i) in table" :key="i">
              <td>{{ value.target }}</td>
              <td>{{ i }}</td>
              <td>{{ value.fb }}</td>
              <td>{{ value.fbm }}</td>
              <td v-if="value.sqrt !== null">{{ value.sqrt }}</td>
            </tr>
          </tbody>
        </table>
      </div>
      <p>
        Предположим, разработчик с многолетним опытом работы оценивает выполнение определенной
        задачи более высоко, чем другой человек, не обладающий столь обширными знаниями/опытом в
        этом вопросе. В этом случае это может привести к предвзятости или неточной оценке. Поэтому
        крайне важно обсудить и проанализировать ситуацию, прежде чем прийти к окончательной оценке.
      </p>
      <p>
        Также важно включать пустые карточки для случаев, когда подходящая оценочная таблица
        отсутствует. Их не следует использовать в качестве стандартных карточек оценки, но они могут
        служить отправной точкой для постановки вопросов, например, о добавлении функции или
        уточнении требований.
      </p>
    </section>
    <section>
      <h2>Правила Planning Poker</h2>
      <p>
        В типичной колоде есть карты, отображающие последовательность Фибоначчи, включая ноль: 0, 1,
        2, 3, 5, 8, 13, 21, 34, 55, 89; возможны и другие подобные последовательности. Причина
        использования последовательности Фибоначчи заключается в отражении неопределенности при
        оценке больших чисел. Высокая оценка обычно означает, что история недостаточно хорошо понята
        в деталях или должна быть разбита на несколько меньших историй. Небольшие истории можно
        оценить более подробно.
      </p>
      <p>
        Сама по себе структура Scrum не предписывает единого способа оценки работы командами Scrum.
        Однако в рамках Scrum оценка обычно производится не по времени, а с помощью более
        абстрактной метрики для количественной оценки трудозатрат. Распространенные методы оценки
        включают числовые размеры (от 1 до 10), размеры футболок (XS, S, M, L, XL, XXL, XXXL) или
        последовательность Фибоначчи (1, 2, 3, 5, 8, 13, 21, 34 и т. д.). Важно, чтобы команда имела
        общее понимание используемой шкалы, чтобы каждый член команды чувствовал себя комфортно.
      </p>
      <p>
        Выбор карты с кофе часто используется как юмористический способ для члена команды указать,
        что ему нужен перерыв или он не уверен в оценке. Это сигнализирует о необходимости короткой
        паузы в процессе оценки для уточнения или обсуждения перед продолжением.
      </p>
      <p>
        Выбор карты со знаком вопроса сигнализирует, что член команды не уверен в правильном
        понимании задачи и ему требуется дополнительное разъяснение.
      </p>
      <b>Игра затем проходит в следующие этапы:</b>
      <ol>
        <li>
          Владелец продукта в Scrum представляет задачу, которую необходимо оценить. Команда Scrum
          задает вопросы, и владелец продукта Scrum объясняет все более подробно. Если задач много,
          может быть установлено ограничение по времени (например, всего одна минута на объяснение).
          Если время ограничено, а команда Scrum не понимает задачу, это означает, что задачу
          необходимо переписать.
        </li>
        <li>
          Каждый член Scrum-команды выбирает в частном порядке карточку, представляющую оценку.
        </li>
        <li>После того, как все выбрали карты, все выбранные карты раскрываются.</li>
        <li>
          Людям, выбравшим завышенные или заниженные оценки, разрешается объяснить свои оценки.
        </li>
        <li>После обсуждения,проводится повторное голосование</li>
        <li>Результат записывается, в том числе и для сравнения с другими задачами</li>
      </ol>
      <p>
        Установите реалистичные ожидания: легко увлечься точными оценками задач, уделяя больше
        внимания мелким деталям, чем сосредоточению на общих необходимых усилиях.
      </p>
      <p>
        Документируйте принятые решения: Убедитесь, что все решения, принятые во время планирования
        с помощью покерных сессий, задокументированы и сохранены для дальнейшего использования при
        необходимости.
      </p>
    </section>
    <section>
      <h2>Распространенные ошибки</h2>
      <p>
        Один из недостатков Planning Poker заключается в том, что «достижение консенсусной оценки»
        становится обязанностью, а не естественным результатом обсуждения после раунда игры. Это
        чревато потерей полезной информации, а именно степени неопределенности, обусловленной
        широким разбросом первоначальных оценок.
      </p>
    </section>
  </article>
</template>

<script setup lang="ts">
import scrumPlanningPokerImage from '~/assets/images/scrum-planning-poker.jpg';

useHead({
  title: 'Planning Poker - описание, правила, оценка | PokerScrum',
  meta: [
    {
      name: 'description',
      content:
        'Planning Poker — метод планирования задач в Scrum используемый в гибком управлении проектами для оценки трудозатрат. Краткая история, правила и этапы игры online.',
    },
  ],
});

const table = [
  {
    target: 'Не требует усилий',
    fb: 0,
    fbm: 0,
    sqrt: 0,
  },
  {
    target: 'Без сложностей',
    fb: 1,
    fbm: 0.5,
    sqrt: 1,
  },
  {
    target: 'Минимальная сложность',
    fb: 2,
    fbm: 1,
    sqrt: 2,
  },
  {
    target: 'Минимальная сложность с неизвестными факторами',
    fb: 3,
    fbm: 2,
    sqrt: '-',
  },
  {
    target: 'Низкая сложность',
    fb: 5,
    fbm: 3,
    sqrt: 4,
  },
  {
    target: 'Средняя-низкая сложность',
    fb: 8,
    fbm: 5,
    sqrt: '-',
  },
  {
    target: 'Средняя сложность',
    fb: 13,
    fbm: 8,
    sqrt: 8,
  },
  {
    target: 'Высокая сложность',
    fb: 21,
    fbm: 13,
    sqrt: 16,
  },
  {
    target: 'Очень высокая сложность',
    fb: 34,
    fbm: 20,
    sqrt: 32,
  },
  {
    target: 'Чрезвычайно высокая сложность',
    fb: 55,
    fbm: 40,
    sqrt: '-',
  },
  {
    target: 'Максимально возможная сложность',
    fb: 89,
    fbm: 100,
    sqrt: 64,
  },
];
</script>
